Revit 2026 API

# IndependentTagAddReferences Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddReferences(
	IList<Reference> referencesToTag
)
```
```vb
Public Sub AddReferences (
	referencesToTag As IList(Of Reference)
)
```
```cpp
public:
void AddReferences(
	IList<Reference^>^ referencesToTag
)
```
```fsharp
member AddReferences :
        referencesToTag : IList<Reference> -> unit
```

#### Parameters

referencesToTag IListReference

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace